
#include <iostream>
using namespace std;
#include "Header.h"

int main()
{
    setlocale(LC_CTYPE, "ukr");
    double corner, dist;
   
    cout << "Градусна мiра кута: " << 20 << endl;
    cout << "Дистанцiя вiд початку координат: " << 4 << endl;
    Vector vec1(20, 4);//стоврюємо об'єкт класу і передаємо у конструктор градусну міру кута та відстань від початку координат
    cout << "Координати точки:(" << vec1.GetX() << " ; " << vec1.GetY() << ")" << endl << endl;

    cout << "Градусна мiра кута: " << 3 << endl;
    cout << "Дистанцiя вiд початку координат: " << 50 << endl;
    Vector vec2(3,50);//стоврюємо об'єкт класу і передаємо у конструктор градусну міру кута та відстань від початку координат
    cout << "Координати точки:(" << vec2.GetX() << " ; " << vec2.GetY() << ")" << endl << endl;

    cout << "-----------------" << endl;
    Vector len(4.5, 1.2);//зменшуємо довжину на число
    cout << "Нова довжина: " << len.GetLength() << endl << "-----------------" << endl;

    Vector add=vec1 + vec2;//математично додаємо вектори
    
    cout << "-----------------" << endl;

    cout << boolalpha;
    bool result = vec1 > vec2;//перевіряємо чи 1 вектор більший за 2(по довжині)

    cout<<"Чи бiльший перший вектор за другий? "<<result<<endl;

    cout << "-----------------" << endl;
    cout << "Декрементування значення кiнцевих координат вектора 1: ";

    vec1--;//зменшуємо координати вектора на 1
    cout << "(" << vec1.GetX() << " ; " << vec1.GetY() << " )" << endl;
  
    cout << "-----------------" << endl;

    cout << "Повернути false, якщо будь-який iз закритих полiв вектора не дорiвнює 0: ";
    
    if (!vec1) {// перевіряємо чи закриті поля вектора 1 дорівнюють 0
        cout << "хоча б одне iз закритих полiв дорiвнює 0";
    }
    else {
        cout << vec1.res;
    }

    return 0;
}

